app/views/pages/home.html.erb

SELECT COUNT(*) FROM "articles"
---
    <%= stylesheet_link_tag "application.css" %>
    <% total_post = Article.count %>

SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
	<% if !params[:p]
      @post =  Article.limit(10)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
	  		<div class="sm-txt">
	  			submitted by <%= User.where(id: item[:user_id]).take['username']%>  at <%= item['created_at'] %>