app/views/pages/item.html.erb

    <% end %>
    <% post = Article.where(id: params[:id]).take %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]

			 <div class="post-title lg-text"><h1><a href='<%= post[:content] %>'><%= post[:title] %></a></h1></div>
			 <div class="sm-text"> submitted by <%= User.where(id: post[:user_id]).take['username']%>  at <%= post[:created_at] %> </div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

		  	<h1> Comments </h1>
		  	<% comments = Comment.where(post_id: params['id']) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]