app/views/pages/newcomments.html.erb

	<% if !params['page']
      @comments =  Comment.limit(15)
---
SELECT  "comments".* FROM "comments" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]

	  	 <% @comments.each do |item| %>
	  	 <% post = Article.where(id: item[:post_id]).take %>
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	    	<div class="comment-details">
	    		<%= User.where(id: item[:user_id]).take[:username]%> <%= item[:created_at] %> on <a href = 'item?id=<%=post[:id]%>'><%= post[:title] %></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]