app/controllers/api_controller.rb

	def dumb_data()
		if params[:item] == "comment"
			data = Comment.where(id: params[:id]).take
		end
		if params[:item] == "article"
			data = Article.where(id: params[:id]).take
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]