app/controllers/article_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "post 2"], ["content", "http://localhost:3000/submit"], ["created_at", "2018-05-13 14:00:01.274988"], ["updated_at", "2018-05-13 14:00:01.274988"], ["user_id", 9]]
---
	def create
		if (!session[:user_id])
			redirect_to root_path
		end
		Article.create(:title=>params['post-title'], :content=>params['post-content'], :user_id=>session[:user_id])