app/controllers/comment_controller.rb

	def new()
		if (!session[:user_id])
			redirect_to root_path
		end
		Comment.create(:content=>params[:comment_content], :post_id=>params[:post_id], :user_id=>params[:user_id])
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "LULUL"], ["user_id", 0], ["post_id", 3], ["created_at", "2018-05-13 11:54:14.414424"], ["updated_at", "2018-05-13 11:54:14.414424"]]