app/controllers/user_controller.rb

	 def create()
	  	User.create(:username=>params['username'], :password=>params['password'])
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "test"], ["password", "testing"], ["created_at", "2018-05-12 17:47:25.526851"], ["updated_at", "2018-05-12 17:47:25.526851"]]